app/controllers/products_controller.rb

  def create
    product = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Kleen Kanteen "], ["price", 0], ["created_at", "2019-06-17 18:20:46.660062"], ["updated_at", "2019-06-17 18:20:46.660062"], ["inventory", 28], ["description", "Not plastic "]]